In [4]:
#dataframe矩形数据表,有行索引和列索引,每一行都可以是不同类型的数据,
#虽然是二维的,但利用层次化索引依旧可以表示高维

In [5]:
#dataframe的创建:
#常用的是传入一个由等长列表或者数组(一般1维)构成的字典

import pandas as pd
import numpy as np
from pandas import Series,DataFrame

#创建dataframe
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame=pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [6]:
#对于特别大的dataframe,head()方法会返回前五行
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [7]:
#相似的tail()方法会返回最后五行
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [8]:
#指定列的顺序,如果传入了不包含的列,就会显示缺失
frame_def=pd.DataFrame(data,columns=["year","state","pop","debt"])
frame_def

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [9]:
frame_def.columns#列标签

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [10]:
#通过类似字典标记的方式或者.属性的方式,可以将dataframe的列获取为一个series对象
series_1=frame_def["state"]
print(series_1)#跟取二维数组的一列差不多array[:,1:2]

#访问.属性
frame_def.year

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [11]:
#frame[column]适用于访问任意名称的列名,但是frame.属性只能使用合理的Python变量名,
#比如使用除空格,下划线以外的符号的列名字

In [12]:
#通过iloc和loc属性可以通过位置或名称的方式获取行

frame_def.loc[0]#

frame_def.iloc[0]#

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: 0, dtype: object

In [13]:
#通过赋值的方法可以修改列,比如给空的列debt赋值
frame_def["debt"]=np.arange(6.0)
frame_def

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [14]:
#将列表和数组赋值给某个列时,长度必须跟dataframe相等
#为不存在的列赋值会创建一个新的列

#可以使用del frame[column]来删除列
del frame_def["debt"]
frame_def

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [ ]:
#创建:
frame_def["debt"]=np.arange(6)
frame_def

   year   state  pop  debt
0  2000    Ohio  1.5     0
1  2001    Ohio  1.7     1
2  2002    Ohio  3.6     2
3  2001  Nevada  2.4     3
4  2002  Nevada  2.9     4
5  2003  Nevada  3.2     5

In [ ]:
#生成一个布尔值的列,nevada的pop小于3的为false
column_b=frame_def["pop"]>=3
print(column_b)

#修改原dataframe
frame_def["bool"]=frame_def["pop"]>=3
frame_def

0    False
1    False
2     True
3    False
4    False
5     True
Name: pop, dtype: bool

   year   state  pop  debt   bool
0  2000    Ohio  1.5     0  False
1  2001    Ohio  1.7     1  False
2  2002    Ohio  3.6     2   True
3  2001  Nevada  2.4     3  False
4  2002  Nevada  2.9     4  False
5  2003  Nevada  3.2     5   True

In [19]:
#索引方式返回的都是视图而非副本,可以通过series的copy方法复制副本

In [ ]:
#输入嵌套字典:外层键解释为列,内层键解释为行索引
data2={"rate":{2011:1.2,2012:1.3,2013:1.4},"value":{2011:10000,2012:12000,2014:13333}}
frame2=pd.DataFrame(data2)
frame2

      rate    value
2011   1.2  10000.0
2012   1.3  12000.0
2013   1.4      NaN
2014   NaN  13333.0

In [26]:
#还可以使用使用类似array.T方法对dataframe转置
frame2.T

          2011     2012  2013     2014
rate       1.2      1.3   1.4      NaN
value  10000.0  12000.0   NaN  13333.0

In [ ]:
#内层字典的键被整合到一起形成结果frame3的索引,可以直接指定行索引
frame3=pd.DataFrame(data2,index=[2012,2013,2014,2015])
frame3

      rate    value
2012   1.3  12000.0
2013   1.4      NaN
2014   NaN  13333.0
2015   NaN      NaN

In [ ]:
#由series组成的字典也可创建frame
data3={"rate":frame3["rate"][:-1],
       "Value":frame3["value"][:-1]
}

print(frame3["value"][:-1])
print(frame3["rate"][:-1])

frame4=pd.DataFrame(data3)
frame4

2012    12000.0
2013        NaN
2014    13333.0
Name: value, dtype: float64
2012    1.3
2013    1.4
2014    NaN
Name: rate, dtype: float64

      rate    Value
2012   1.3  12000.0
2013   1.4      NaN
2014   NaN  13333.0

In [ ]:
#可以向dataframe构造器输入的数据:
"""
2维数组    传入可选的行标签和列标签

由数组,列表,元组组成的字典   每个序列会变成一列,所有序列的长度必须一致

由字典组成的字典        
由series组成的字典      各个单独字典为一列,外层键为列column,内层键会被合并到一起形成行索引

由列表或者元组组成的列表   与二维数组处理方法一致

dataframe       会沿用上一个dataframe的索引,除非指定
"""

In [39]:
#设置name属性,这些信息也会输出
frame4.index.name="years"
frame4.columns.name="change"
frame4

change  rate    Value
years
2012     1.3  12000.0
2013     1.4      NaN
2014     NaN  13333.0

In [40]:
#dataframe的to_numpy()方法将数据以二维数组的dataframe形式返回
frame4.to_numpy()

array([[1.3000e+00, 1.2000e+04],
       [1.4000e+00,        nan],
       [       nan, 1.3333e+04]])

In [45]:
#如果dataframe每一列的数组类型不同,那么数组(要求元素同一)会选用能兼容所有列数组类型的类型
print(frame)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [ ]:
frame.to_numpy()#类型为对象

array([['Ohio', 2000, 1.5],
       ['Ohio', 2001, 1.7],
       ['Ohio', 2002, 3.6],
       ['Nevada', 2001, 2.4],
       ['Nevada', 2002, 2.9],
       ['Nevada', 2003, 3.2]], dtype=object)